{
    "format": "layers-model",
    "generatedBy": "keras v3.4.1",
    "convertedBy": "TensorFlow.js Converter v4.21.0",
    "modelTopology": {
        "keras_version": "3.4.1",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Functional",
            "config": {
                "name": "functional",
                "trainable": true,
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_shape": [
                                null,
                                64,
                                128,
                                1
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "name": "input_layer"
                        },
                        "name": "input_layer",
                        "inbound_nodes": []
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 32,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                64,
                                                128,
                                                1
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "input_layer",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                64,
                                                128,
                                                32
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Conv2D",
                        "config": {
                            "name": "conv2d_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "filters": 64,
                            "kernel_size": [
                                3,
                                3
                            ],
                            "strides": [
                                1,
                                1
                            ],
                            "padding": "same",
                            "data_format": "channels_last",
                            "dilation_rate": [
                                1,
                                1
                            ],
                            "groups": 1,
                            "activation": "relu",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        },
                        "name": "conv2d_1",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                32,
                                                64,
                                                32
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "max_pooling2d",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "MaxPooling2D",
                        "config": {
                            "name": "max_pooling2d_1",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "pool_size": [
                                2,
                                2
                            ],
                            "padding": "valid",
                            "strides": [
                                2,
                                2
                            ],
                            "data_format": "channels_last"
                        },
                        "name": "max_pooling2d_1",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                32,
                                                64,
                                                64
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "conv2d_1",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "Reshape",
                        "config": {
                            "name": "reshape",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "target_shape": [
                                32,
                                -1
                            ]
                        },
                        "name": "reshape",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                16,
                                                32,
                                                64
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "max_pooling2d_1",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {}
                            }
                        ]
                    },
                    {
                        "class_name": "GRU",
                        "config": {
                            "name": "gru",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "return_sequences": true,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "zero_output_for_mask": false,
                            "units": 128,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "module": "keras.initializers",
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "recurrent_initializer": {
                                "module": "keras.initializers",
                                "class_name": "OrthogonalInitializer",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                },
                                "registered_name": null
                            },
                            "bias_initializer": {
                                "module": "keras.initializers",
                                "class_name": "Zeros",
                                "config": {},
                                "registered_name": null
                            },
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "reset_after": true,
                            "seed": null
                        },
                        "name": "gru",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                32,
                                                1024
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "reshape",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {
                                    "training": false,
                                    "mask": null
                                }
                            }
                        ]
                    },
                    {
                        "class_name": "TimeDistributed",
                        "config": {
                            "name": "time_distributed",
                            "trainable": true,
                            "dtype": {
                                "module": "keras",
                                "class_name": "DTypePolicy",
                                "config": {
                                    "name": "float32"
                                },
                                "registered_name": null
                            },
                            "layer": {
                                "module": "keras.layers",
                                "class_name": "Dense",
                                "config": {
                                    "name": "dense",
                                    "trainable": true,
                                    "dtype": {
                                        "module": "keras",
                                        "class_name": "DTypePolicy",
                                        "config": {
                                            "name": "float32"
                                        },
                                        "registered_name": null
                                    },
                                    "units": 49,
                                    "activation": "softmax",
                                    "use_bias": true,
                                    "kernel_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "GlorotUniform",
                                        "config": {
                                            "seed": null
                                        },
                                        "registered_name": null
                                    },
                                    "bias_initializer": {
                                        "module": "keras.initializers",
                                        "class_name": "Zeros",
                                        "config": {},
                                        "registered_name": null
                                    },
                                    "kernel_regularizer": null,
                                    "bias_regularizer": null,
                                    "kernel_constraint": null,
                                    "bias_constraint": null
                                },
                                "registered_name": null,
                                "build_config": {
                                    "input_shape": [
                                        null,
                                        128
                                    ]
                                }
                            }
                        },
                        "name": "time_distributed",
                        "inbound_nodes": [
                            {
                                "args": [
                                    {
                                        "class_name": "__keras_tensor__",
                                        "config": {
                                            "shape": [
                                                null,
                                                32,
                                                128
                                            ],
                                            "dtype": "float32",
                                            "keras_history": [
                                                "gru",
                                                0,
                                                0
                                            ]
                                        }
                                    }
                                ],
                                "kwargs": {
                                    "mask": null
                                }
                            }
                        ]
                    }
                ],
                "input_layers": [
                    [
                        "input_layer",
                        0,
                        0
                    ]
                ],
                "output_layers": [
                    [
                        "time_distributed",
                        0,
                        0
                    ]
                ]
            }
        },
        "training_config": {
            "loss": "categorical_crossentropy",
            "loss_weights": null,
            "metrics": null,
            "weighted_metrics": null,
            "run_eagerly": false,
            "steps_per_execution": 1,
            "jit_compile": false,
            "optimizer_config": {
                "class_name": "Adam",
                "config": {
                    "name": "adam",
                    "learning_rate": 0.0010000000474974513,
                    "weight_decay": null,
                    "clipnorm": null,
                    "global_clipnorm": null,
                    "clipvalue": null,
                    "use_ema": false,
                    "ema_momentum": 0.99,
                    "ema_overwrite_frequency": null,
                    "loss_scale_factor": null,
                    "gradient_accumulation_steps": null,
                    "beta_1": 0.9,
                    "beta_2": 0.999,
                    "epsilon": 1e-07,
                    "amsgrad": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of1.bin"
            ],
            "weights": [
                {
                    "name": "conv2d/kernel",
                    "shape": [
                        3,
                        3,
                        1,
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d/bias",
                    "shape": [
                        32
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/kernel",
                    "shape": [
                        3,
                        3,
                        32,
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "conv2d_1/bias",
                    "shape": [
                        64
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "gru/gru_cell/kernel",
                    "shape": [
                        1024,
                        384
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "gru/gru_cell/recurrent_kernel",
                    "shape": [
                        128,
                        384
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "gru/gru_cell/bias",
                    "shape": [
                        2,
                        384
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/kernel",
                    "shape": [
                        128,
                        49
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        49
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}