{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,64,128,1],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"conv2d_Conv2D1","class_name":"Conv2D","config":{"filters":32,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D1","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D1","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D1","trainable":true},"inbound_nodes":[[["conv2d_Conv2D1",0,0,{}]]]},{"name":"conv2d_Conv2D2","class_name":"Conv2D","config":{"filters":64,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"kernel_regularizer":null,"kernel_constraint":null,"kernel_size":[3,3],"strides":[1,1],"padding":"same","data_format":"channels_last","dilation_rate":[1,1],"activation":"relu","use_bias":true,"bias_initializer":{"class_name":"Zeros","config":{}},"bias_regularizer":null,"activity_regularizer":null,"bias_constraint":null,"name":"conv2d_Conv2D2","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D1",0,0,{}]]]},{"name":"max_pooling2d_MaxPooling2D2","class_name":"MaxPooling2D","config":{"pool_size":[2,2],"padding":"valid","strides":[2,2],"data_format":"channels_last","name":"max_pooling2d_MaxPooling2D2","trainable":true},"inbound_nodes":[[["conv2d_Conv2D2",0,0,{}]]]},{"name":"flatten_Flatten1","class_name":"Flatten","config":{"name":"flatten_Flatten1","trainable":true},"inbound_nodes":[[["max_pooling2d_MaxPooling2D2",0,0,{}]]]},{"name":"reshape_Reshape1","class_name":"Reshape","config":{"target_shape":[32,1024],"name":"reshape_Reshape1","trainable":true},"inbound_nodes":[[["flatten_Flatten1",0,0,{}]]]},{"name":"gru_GRU1","class_name":"GRU","config":{"name":"gru_GRU1","trainable":true,"units":128,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0,"implementation":null,"reset_after":false,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["reshape_Reshape1",0,0,{}]]]},{"name":"time_distributed_TimeDistributed1","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":49,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},"name":"time_distributed_TimeDistributed1","trainable":true},"inbound_nodes":[[["gru_GRU1",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["time_distributed_TimeDistributed1",0,0]]},"keras_version":"tfjs-layers 4.21.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"conv2d_Conv2D1/kernel","shape":[3,3,1,32],"dtype":"float32"},{"name":"conv2d_Conv2D1/bias","shape":[32],"dtype":"float32"},{"name":"conv2d_Conv2D2/kernel","shape":[3,3,32,64],"dtype":"float32"},{"name":"conv2d_Conv2D2/bias","shape":[64],"dtype":"float32"},{"name":"gru_GRU1/kernel","shape":[1024,384],"dtype":"float32"},{"name":"gru_GRU1/recurrent_kernel","shape":[128,384],"dtype":"float32"},{"name":"gru_GRU1/bias","shape":[384],"dtype":"float32"},{"name":"time_distributed_TimeDistributed1/kernel","shape":[128,49],"dtype":"float32"},{"name":"time_distributed_TimeDistributed1/bias","shape":[49],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.21.0","convertedBy":null}